Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །གང་གི་ཚེ་ཕའི་ཁྱིམ་ན་གནས་པ་དེའི་ཚེ་ནི་ཁྱིམ་ཐབ་འདོད་དེ།
en: When you are in your father’s house, you miss your husband.

source: ཁྱོད་ཚུལ་མ་ཡིན་པས་སྡུག་བསྔལ་བར་གྱུར་ན་མི་རུང་གིས་གནས་གཅིག་ཐོང་ལ་གཅིག་ལེགས་པར་གཟུང་བར་བྱོས་ཤིག་ཅེས་སྒོ་ཤིག །བག་སར་གཞོན་ནུ་མ་དེ་དང་སྦྲུལ་གྱིས་ནི་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་བྱས་སོ།
en: Since it would not be right if you suffered misfortune, relinquish one place and keep well the other.” ’ “The newly married woman and the snake did as they were instructed.

source: །སྦྲུལ་དང་ནེའུ་ལེ་དག་དང་ཁྭས་ནི་ནོར་དབྱུག་གུ་ཅན་ལ་བྱིན་ནོ།
en: The serpent and mongoose and the raven gave the treasures to Daṇḍin.

source: །ལྷག་མ་རྣམས་ཀྱིས་ཀྱང་ཇི་སྐད་བསྟན་པ་དེ་བཞིན་མཉན་ཏོ།
en: The rest, too, did as they were instructed.

source: །བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ། ཀྱེ་མའོ་ལྷ་ལ་འདི་ལྟ་བུའི་སྤོབས་པ་ཡང་མངའ་བ་ལྟ།
en: “ ‘Oh, the king appears to be quite brilliant!’ marveled the ministers.

source: རྒྱལ་པོ་དགའ་བ་དང་མགུ་བས་གྲོང་ཁྱེར་གྱི་སྒོ་བཞི་རྣམས་སུ་སྦྱིན་གཏོང་གི་ཁང་པ་བརྩིགས་ནས་སྦྱིན་པའི་ཞལ་ཏ་བའི་མི་དག་བཞག་གོ།
en: “The king, pleased and delighted, built offering halls at the four city gates and appointed managers of the offerings.

source: །དེའི་ཚེ་མུ་གེ་ལོ་བཅུ་གཉིས་སུ་བྱུང་སྟེ།
en: “At that time, there was a famine for twelve years.

source: དེས་མུ་གེ་ལོ་བཅུ་གཉིས་སུ་བྱུང་བ་ན་སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་གི་ཁ་ཟས་སྦྱར་ཏོ།
en: When that twelve-year famine occurred, he provided hundreds of thousands of beings with food.

source: །དེས་བདག་ཉིད་ཀྱི་མཆོད་སྦྱིན་ཕུན་སུམ་ཚོགས་པ་མཐོང་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Taking account of the perfection of his offerings, he spoke these verses:

source: བློ་ལྡན་ཆོས་དང་མཐུན་པ་ཡིན།
en: “ ‘A wise one is in accord with the law—

source: །ནོར་རྙེད་བསགས་པར་མི་བྱ་སྟེ།
en: He does not accumulate wealth. He makes offerings to those worthy of veneration

source: །ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་ཡི། །ཡོན་གནས་ལ་ནི་ཡོན་དུ་དབུལ།
en: Who are perfect in good conduct.

source: །དགེ་སྦྱོང་བྲམ་ཟེ་དེས་པ་དང་། །ཕོངས་པ་ལེགས་པར་ཚིམ་བྱས་ན།
en: “ ‘Having well satisfied noble śramaṇas, brahmins, And the destitute,

source: །ཤེས་རབ་ཅན་དེ་ལུས་ཞིག་ནས། །ལྷ་ཡི་ནང་དུ་སྐྱེ་བར་འགྱུར།
en: The intelligent one will be reborn Among the gods after his body is destroyed.

source: །མཁས་པས་དེ་ལྟར་ཤེས་བྱས་ནས།
en: “ ‘Knowing this, one who is wise

source: །དད་ལྡན་ཆགས་པ་མེད་སེམས་ཀྱིས།
en: And possessed of faith, with thoughts free from attachment,

source: །ཡོན་གནས་རྣམས་ལ་བྱིན་པ་ནི།
en: Gives to those worthy of veneration,

source: །དཔའ་བོ་སེར་སྣ་མེད་པས་བསྔགས།
en: Which is praised by heroes free from avarice.’

source: །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་མེ་ལོང་གདོང་ཞེས་བྱ་བ་མཐུ་དང་ལྡན་པ་གང་གིས་མུ་གེ་ལོ་བཅུ་གཉིས་སུ་བྱུང་བ་ན་སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་ཁ་ཟས་སྦྱར་བ་དེ་གཞན་ཞིག་ཡིན་སྙམ་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that the one who was that mighty king named Ādarśamukha, who provided hundreds of thousands of beings with food during the twelve-year famine, at that time, on that occasion, was someone else, you should think otherwise.

source: འོན་ཀྱང་ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་མེ་ལོང་གདོང་ཞེས་བྱ་བ་མཐུ་དང་ལྡན་པ་དེར་གྱུར་ཏེ། ངས་མུ་གེ་ལོ་བཅུ་གཉིས་སུ་བྱུང་བ་ན་སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་གི་ཁ་ཟས་སྦྱར་ཏོ།
en: I was the mighty king named Ādarśamukha, and I provided hundreds of thousands of beings with food during the twelve-year famine at that time, on that occasion.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར་སྦྱིན་པ་དག་བྱིན། བསོད་ནམས་དག་བྱས་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ནོར་བཟངས་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: “Great King, again, seeking supreme and complete awakening, I gave donations and made merit. Listen to that story. “Great King, once there was a wheel-turning king named Sudhana.

source: དེས་གྲོང་ཁྱེར་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་མཆོད་སྦྱིན་གྱི་གནས་བརྩིགས་ཏེ་ལོ་མང་པོ་དང་ལོ་བརྒྱ་ཕྲག་མང་པོ་དང་། ལོ་སྟོང་ཕྲག་མང་པོ་དང་། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་སྦྱིན་པ་དག་བྱིན། བསོད་ནམས་དག་བྱས་ཏེ།
en: He built places for offerings in eighty-four thousand cities. He gave donations and made merit for many years—hundreds of years, thousands of years, hundreds of thousands of years.

source: དེས་བདག་ཉིད་ཀྱི་མཆོད་སྦྱིན་ཕུན་སུམ་ཚོགས་པ་མཐོང་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Having seen the perfection of his offerings, he spoke these verses:

source: །འཇིག་རྟེན་ཕ་རོལ་འཇིགས་པས་སྦྱིན་གཏོང་དེ།
en: One who fears the next life gives donations

source: །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ནོར་བཟངས་ཞེས་བྱ་བ་གང་གིས་གྲོང་ཁྱེར་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་མཆོད་སྦྱིན་གྱི་གནས་བརྩིགས་ཏེ་ལོ་མང་པོ་དང་ལོ་བརྒྱ་ཕྲག་མང་པོ་དང་། ལོ་སྟོང་ཕྲག་མང་པོ་དང་། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་སྦྱིན་པ་དག་བྱིན། བསོད་ནམས་དག་བྱས་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that the one who was that wheel-turning king named Sudhana, who built places for offerings in eighty-four thousand cities, who gave donations and made merit for many years—hundreds of years, thousands of years, hundreds of thousands of years—at that time, on that occasion, was someone else, you should think otherwise.

source: འོན་ཀྱང་ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ནོར་བཟངས་ཞེས་བྱ་བ་དེར་གྱུར་ཏེ། ང་ཉིད་ཀྱིས་དེ་ན་གྲོང་ཁྱེར་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་མཆོད་སྦྱིན་གྱི་གནས་བརྩིགས་ཏེ་ལོ་མང་པོ་དང་ལོ་བརྒྱ་ཕྲག་མང་པོ་དང་། ལོ་སྟོང་ཕྲག་མང་པོ་དང་། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་སྦྱིན་པ་དག་བྱིན། བསོད་ནམས་དག་བྱས་སོ།
en: I was the wheel-turning king named Sudhana at that time, on that occasion, who built places for offerings in eighty-four thousand cities, who gave donations and made merit for many years—hundreds of years, thousands of years, hundreds of thousands of years.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར་སྦྱིན་པ་དག་བྱིན། བསོད་ནམས་དག་བྱས་ཏེ། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མ་ཐོབ་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་ཡུལ་ལྔ་ལེན་པར་རྒྱལ་པོ་གཉིས་བྱུང་སྟེ།
en: “Great King, again, seeking supreme and complete awakening, I gave donations and made merit, and accomplished the perfection of effort, but I did not attain supreme and complete awakening. Listen to that story.

source: བྱང་ཕྱོགས་ཀྱི་ལྔ་ལེན་དང་ལྷོ་ཕྱོགས་ཀྱི་ལྔ་ལེན་པའོ།
en: “Great King, once there were two kings in the land of Pañcāla, namely, North Pañcāla and South Pañcāla.

source: །དེ་ལ་བྱང་ཕྱོགས་ཀྱི་ལྔ་ལེན་པ་ནོར་ཅན་ཞེས་བྱ་བ་གྲོང་ཁྱེར་གླང་པོའི་ཁྱིམ་ཞེས་བྱ་བ་ན་འབྱོར་པ་དང་རྒྱས་པ་དང་བདེ་བ་དང་། ལོ་ལེགས་པ་སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་འཐབ་པ་དང་། ཁྲག་ཁྲུག་དང་འགྱེད་པ་དང་ཆོམ་རྐུན་མེད་པ་ནད་རབ་ཏུ་ཞི་བར་གྱུར་པ་འབྲས་སཱ་ལུ་དང་། བུ་རམ་ཤིང་དང་བ་ལང་དང་། མ་ཧེ་ཕུན་སུམ་ཚོགས་པ་ན་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་དང་། ཆོས་བཞིན་གྱིས་རྒྱལ་སྲིད་བྱེད་དུ་འཇུག་གོ།
en: King North Pañcāla, called Dhana, in a city called Hastināpura, being a righteous Dharma king ruled in accordance with the Dharma over the country, which was rich, prosperous, peaceful, abundant in food, and full of many people, and in which there was no fighting, dispute, strife, or robbers, in which illness had abated, and which was abundant in rice , sugarcane, cattle, and buffalo.

source: །གྲོང་ཁྱེར་དེ་ན་ཡང་མཚོ་ཆེན་པོ་ཨུཏྤ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོས་གང་བ། ངང་པ་དང་ངུར་པ་དང་བྱ་ཀཱ་རཎྜ་བས་མཛེས་པར་བྱས་པ་ཡིད་དུ་འོང་བ་ཡོད་དོ། །མཚོ་དེ་ན་ཀླུའི་བུ་སྐྱེ་བ་སྣ་ཚོགས་པ་ཞེས་བྱ་བ་གནས་ཏེ།
en: “In that city there was a large, pleasant pond full of utpala, padma, kumuda, and puṇḍarīka flowers, and adorned with haṃsas, cakravākas, and kāraṇḍavas. In the pond there lived the son of a nāga named Janmacitra.

source: དེས་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་ལེགས་པར་ཕབ་པས་ས་གཞི་ལྷག་པར་ལོ་ཐོག་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཏོ།
en: He brought rain at the appropriate times, so that the ground was rich in crops.

source: །ཡུལ་ཡང་བཟའ་བ་དང་བཏུང་བ་ཤིན་ཏུ་མོད་ལ། འཇིག་རྟེན་ཡང་སྦྱིན་པ་དང་། མཆོད་པ་དང་བསྙེན་བཀུར་དང་ལྡན་པས་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་བཀྲེན་པ་དང་ཕོངས་པ་རྣམས་ལ་ཁ་ཟས་སྦྱིན་པར་བྱེད་དོ།
en: The country had plenty of food and drink, and people gave food to śramaṇas, brahmins, the poor, and the destitute with generosity, veneration, and respect.

source: །ལྷོ་ཕྱོགས་ཀྱི་ལྔ་ལེན་པའི་རྒྱལ་པོ་ནི་ཆོས་མ་ཡིན་པ་ལ་ལྷག་པར་གནས་པ།
en: “King South Pañcāla was excessively unrighteous, fierce, violent, and short tempered.

source: གཏུམ་པ། གཟུ་ལུམས་ཅན། སྤྲོ་ཐུང་བ་ཞིག་པས་ཆོས་མ་ཡིན་པས་རྒྱལ་སྲིད་བྱེད་ཅིང་ཆད་པ་དང་། རྡེག་པ་དང་། འཚོག་པ་དང་། གསོད་པ་དང་། འཛིན་པ་དང་། འཆིང་བ་དང་། སུ་མི་འདོད་དང་། ཁོང་སྒྲིལ་དང་། གནོད་པ་སྣ་ཚོགས་ཀྱིས་ཡུལ་ན་གནས་པའི་སྐྱེ་བོ་རྣམས་ལ་རྟག་ཏུ་སྐྲག་པར་བྱེད་དོ།
en: He did not rule over the kingdom in accordance with the Dharma and always threatened people living in the country with punishment, beating, hitting, killing, arresting, binding, fettering, chaining, and various other kinds of harm.

source: །དེས་ཆོས་མ་ཡིན་པ་ལ་ལྷག་པར་གནས་པས་དེས་ལྷ་ཡང་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་ལེགས་པར་མི་འབེབས་སོ།
en: Because he was excessively unrighteous, the gods did not bring rain at the appropriate times.

source: །དེས་ན་སྐྱེ་བོའི་ཚོགས་དེ་འཇིགས་པ་དང་། ཡི་ཆད་པས་རང་གི་སྲོག་ལ་ཡང་མི་ལྟ་བར་ཡུལ་ཡོངས་སུ་སྤངས་ཏེ་བྱང་ཕྱོགས་ཀྱི་ལྔ་ལེན་པའི་རྒྱལ་པོའི་ཡུལ་དུ་དོང་ནས་གནས་སོ།
en: Thus, through fear and despair, his people abandoned their country at the risk of their lives and went to North Pañcāla’s land, where they settled.

source: །ཇི་ཙམ་དུས་གཞན་ཞིག་ན་ལྷོ་ཕྱོགས་ཀྱི་ལྔ་ལེན་པའི་རྒྱལ་པོ་རི་དགས་འཆོར་བའི་ཚུལ་དུ་བྱས་ནས་ཡུལ་རྣམས་བརྟག་པའི་ཕྱིར་བྱུང་བ་དང་། གྲོང་རྡལ་དང་གྲོང་ཁྱེར་གང་ཡིན་པ་དག་ནི་སྟོངས་པར་གྱུར་ཅིང་། སྐྱེད་མོས་ཚལ་དང་ལྷ་ཁང་རྣམས་ནི་ཞིག་རལ་དུ་གྱུར་པར་མཐོང་ངོ་།
en: “Later, when King South Pañcāla set out to inspect the country under the pretext of hunting, he saw villages and cities deserted, parks and temples ruined and destroyed.

source: །མཐོང་ནས་ཀྱང་བློན་པོ་རྣམས་ལ་སྨྲས་པ། ཤེས་ལྡན་དག་ཅིའི་ཕྱིར་གྲོང་རྡལ་དང་གྲོང་ཁྱེར་འདི་སྟོངས་པར་གྱུར་ཅིང་།
en: When he saw them, he asked his ministers, ‘Sirs, why are these villages and cities deserted?

source: སྐྱེད་མོས་ཚལ་དང་ལྷ་ཁང་རྣམས་ནི་ཞིག་རལ་དུ་གྱུར།
en: Why are the parks and temples ruined and destroyed?

source: སྐྱེ་བོའི་ཚོགས་དེ་དག་ནི་གང་དུ་དོང་། བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ།
en: Where have those people gone?’

source: ལྷ་བྱང་ཕྱོགས་ཀྱི་ལྔ་ལེན་པའི་རྒྱལ་པོ་ནོར་ཅན་གྱི་ཡུལ་དུ་མཆིས་སོ།
en: “ ‘Your Majesty,’ the ministers replied, ‘they have gone to the land of Dhana, King North Pañcāla.’

source: །ཅིའི་ཕྱིར།
en: “ ‘For what reason?’

source: ལྷ་མི་འཇིགས་པ་སྩལ་དུ་གསོལ། ཤེས་ལྡན་སྦྱིན་གྱིས་སྨྲོས་ཤིག །དེ་ནས་དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: “ ‘Your Majesty, please grant us the freedom to speak without fear.’ “ ‘Sirs, I do. Speak.’

source: ལྷ་བྱང་ཕྱོགས་ཀྱི་ལྔ་ལེན་པའི་རྒྱལ་པོ་ཆོས་བཞིན་གྱིས་རྒྱལ་སྲིད་བགྱིད་པས་དེའི་ཡུལ་འབྱོར་པ་དང་རྒྱས་པ་དང་། བདེ་བ་དང་ལོ་ལེགས་པ་སྐྱེ་བོ་དང་། མི་མང་པོས་གང་ཞིང་འཐབ་པ་དང་། རྩོད་པ་དང་། ཁྲག་ཁྲུག་དང་། འགྱེད་པ་དང་། ཆོམ་རྐུན་མ་མཆིས་ལ་ནད་རབ་ཏུ་ཞི་བར་གྱུར་པ།
en: “And so they told him, ‘Your Majesty, King North Pañcāla rules over the country in accordance with the Dharma, and so his land is rich, prosperous, peaceful, abundant in food, and full of many people. There is no fighting, combat, dispute, strife, or robbers; illness has abated there;

source: འབྲས་སཱ་ལུ་དང་། བུ་རམ་ཤིང་དང་། བ་ལང་དང་། མ་ཧེ་ཕུན་སུམ་ཚོགས་པ།
en: and the country is abundant in rice, sugarcane, cattle, and buffalo.

source: འཇིག་རྟེན་ཡང་སྦྱིན་པ་དང་། མཆོད་པ་དང་། བསྙེན་བཀུར་དང་ལྡན་པས་དགེ་སྦྱོང་དང་བྲམ་ཟེ་དང་བཀྲེན་པ་དང་། ཕོངས་པ་རྣམས་ལ་ཁ་ཟས་སྩོལ་བར་བགྱིད་དོ། །ལྷ་ནི་གཏུམ་པ་གཟུ་ལུམས་ཅན།
en: People, eager to offer generosity, veneration, and respect, also give food to śramaṇas, brahmins, the poor, and the destitute.

source: སྤྲོ་ཐུང་བས་ཆད་པ་དང་། རྡེག་པ་དང་འཚོག་པ་དང་། གསོད་པ་དང་འཛིན་པ་དང་། འཆིང་བ་དང་སུ་མི་འདོད་དང་། ཁོང་སྒྲིལ་དང་། གནོད་པ་སྣ་ཚོགས་ཀྱིས་ཡུལ་མི་རྣམས་ལ་རྟག་ཏུ་སྐྲག་པར་མཛད་པས་དེས་ན་སྐྱེ་བོའི་ཚོགས་དེ་འཇིགས་ཤིང་ཡི་ཆད་ནས་བྱང་ཕྱོགས་པའི་ལྔ་ལེན་པའི་རྒྱལ་པོའི་ཡུལ་དུ་མཆིས་ལགས་སོ།
en: Your Majesty is fierce, violent, and short tempered, and so you always threaten your people with punishment, beating, hitting, killing, arresting, binding, fettering, chaining, and various other kinds of harm. Therefore, through fear and despair, those people have gone to King North Pañcāla’s land.’

source: །ལྷོ་ཕྱོགས་ཀྱི་ལྔ་ལེན་པའི་རྒྱལ་པོས་སྨྲས་པ། ཤེས་ལྡན་དག་གང་གིས་ན་སྐྱེ་བོའི་ཚོགས་དེ་སླར་འོངས་ནས་གྲོང་རྡལ་དང་གྲོང་ཁྱེར་འདི་དག་ཏུ་གནས་པར་འགྱུར་བའི་ཐབས་བཟང་པོ་ཅི་ཡོད།
en: “ ‘Sirs,’ King South Pañcāla asked them, ‘is there any good means whereby those people will come back and live in these villages and cities?’

source: བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་གལ་ཏེ་བྱང་ཕྱོགས་ཀྱི་ལྔ་ལེན་པའི་རྒྱལ་པོ་བཞིན་དུ་ཆོས་བཞིན་གྱིས་རྒྱལ་སྲིད་མཛད་དེ། བྱམས་པའི་སེམས་དང་ཕན་པའི་སེམས་དང་། ཐུགས་བརྩེ་བའི་སེམས་ཀྱིས་ཡུལ་བསྐྱངས་ན་རིང་པོ་མི་ཐོགས་པར་སྐྱེ་བོའི་ཚོགས་དེ་སླར་མཆིས་ནས་གྲོང་རྡལ་དང་གྲོང་ཁྱེར་འདི་རྣམས་སུ་གནས་པར་འགྱུར་ལགས་སོ། །ལྷོ་ཕྱོགས་ཀྱི་ལྔ་ལེན་པའི་རྒྱལ་པོས་སྨྲས་པ།
en: “The ministers answered, ‘If Your Majesty rules over the country in accordance with the Dharma and protects the land with thoughts of love, benefit, and compassion just as King North Pañcāla does, those people will soon come back and live in these villages and cities.’

source: ཤེས་ལྡན་དག་གལ་ཏེ་དེ་ལྟ་ན་ངས་ཀྱང་བྱང་ཕྱོགས་ཀྱི་ལྔ་ལེན་པའི་རྒྱལ་པོ་བཞིན་དུ་ཆོས་བཞིན་གྱིས་རྒྱལ་སྲིད་བྱས་ཏེ། བྱམས་པའི་སེམས་དང་ཕན་པའི་སེམས་དང་། སྙིང་བརྩེ་བའི་སེམས་ཀྱིས་ཡུལ་བསྐྱང་བར་བྱས།
en: “ ‘If so, sirs,’ replied King South Pañcāla, ‘I too will rule over the country in accordance with the Dharma and protect the land with thoughts of love, benefit, and compassion just as King North Pañcāla does.

source: ཁྱེད་ཀྱིས་ཅི་ནས་ཀྱང་སྐྱེ་བོའི་ཚོགས་དེ་སླར་འོངས་ནས་གྲོང་རྡལ་དང་གྲོང་ཁྱེར་འདི་རྣམས་སུ་གནས་པར་འགྱུར་བ་དེ་ལྟར་གྱིས་ཤིག །ལྷ་ཡོན་ཏན་གཞན་ཡང་འདི་ལྟ་བུ་མཆིས་ཏེ།
en: You should make those people come back and live in these villages and cities by any means.’ “ ‘Your Majesty, there is another advantage.

source: གྲོང་ཁྱེར་དེ་ན་མཚོ་ཆེན་པོ་ཨུཏྤ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོས་གང་བ།
en: In that city, there is a large pond full of utpala, padma, kumuda, and puṇḍarīka flowers, and adorned with haṃsas, cakravākas, and kāraṇḍavas.

source: ངང་པ་དང་། ངུར་པ་དང་། བྱ་ཀཱ་རཎྜ་བས་མཛེས་པར་བགྱིས་པ་དེ་ན་ཀླུའི་བུ་སྐྱེ་བ་སྣ་ཚོགས་པ་ཞེས་བགྱི་བ་ཞིག་གནས་ཏེ།
en: There lives the son of a nāga named Janmacitra.

source: དེས་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་ལེགས་པར་ཕབ་པས་ལོ་ཏོག་ལྷག་པར་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཏོ། །དེས་ན་ས་གཞི་ལྷག་པར་ལོ་ཏོག་དང་ལྡན་པས་ཡུལ་ཡང་བཟའ་བ་དང་བཏུང་བ་ཤིན་ཏུ་མོད་ལགས་སོ།
en: Because he duly brings rain at the appropriate times, the ground is richer and richer in crops, and so and the country has plenty of food and drink.’

source: །རྒྱལ་པོས་སྨྲས་པ། ཤེས་ལྡན་དག་གང་གིས་ན་ཀླུའི་བུ་དེ་འདིར་ཁུགས་པར་འགྱུར་བའི་ཐབས་ལྟ་ཅི་ཡོད།
en: “ ‘Sirs, is there any way to bring that son of a nāga here?’ asked the king.

source: ལྷ་རིག་སྔགས་དང་གསང་སྔགས་འཆང་དག་གིས་དེ་ཁུགས་པར་འགྱུར་གྱིས།
en: “ ‘Your Majesty, wielders of spells and mantras could bring him.

source: དེ་དག་བཙལ་དུ་གསོལ་དེ་ནས་རྒྱལ་པོས་གསེར་གྱི་ཐུམ་པོ་རྒྱལ་མཚན་གྱི་རྩེ་མོ་ལ་བཅིངས་ནས་ཡུལ་ཐམས་ཅད་དུ་དྲིལ་བསྒྲགས་ཏེ།
en: Please search for them.’ “The king then had a box of gold tied to the top of a banner and had proclaimed throughout the country with the ringing of bells:

source: གང་གིས་བྱང་ཕྱོགས་ལྔ་ལེན་པའི་ཡུལ་ནས་ཀླུའི་བུ་སྐྱེ་བ་སྣ་ཚོགས་པ་ཁུགས་ན་དེ་ལ་གསེར་གྱི་ཐུམ་པོ་འདི་སྦྱིན་ནོ།
en: ‘I will give this box of gold to anyone who brings Janmacitra, the son of a nāga, from North Pañcāla’s land.

source: །བཀུར་སྟི་ཆེན་པོས་ཀྱང་བཀུར་སྟི་བྱའོ།
en: I will also treat him with great honor.’

source: །ཇི་ཙམ་ན་སྦྲུལ་ཁས་སྡིགས་པ་ཞིག་བློན་པོ་རྣམས་ཀྱི་དྲུང་དུ་སོང་ནས་སྨྲས་པ། བདག་ལ་གསེར་གྱི་ཐུམ་པོ་འདི་སྩལ་ན་བདག་གིས་ཀླུའི་བུ་སྐྱེ་བ་སྣ་ཚོགས་པ་ཕྲོགས་ཏེ་ཁྲིད་དེ་མཆིའོ།
en: “A certain snake charmer went to the ministers and said, ‘If you would give me this box of gold, I will catch and bring Janmacitra, the son of a nāga.’

source: །བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ། འདི་ཁྱེར་ཅིག་དེས་སྨྲས་པ།
en: “ ‘Take it,’ said the ministers.

source: ཁྱེད་ཅག་གང་ལ་ཡིད་ཆེས་ཤིང་ཡིད་བརྟན་པ་དེའི་ལག་ཏུ་བཞག་ལ་ཀླུའི་བུ་སྐྱེ་བ་སྣ་ཚོགས་པ་ཁྲིད་དེ་མཆིས་ནས་འཚལ་ལོ།
en: “ ‘Please have it kept in the hands of someone whom you trust and have confidence in,’ he replied, ‘and give it to me after I bring Janmacitra, the son of a nāga.’

source: །དེ་བཞིན་དུ་གྱིས་ཤིག་དེ་ནས་སྦྲུལ་ཁས་སྡིགས་པ་དེས་མི་ཡིད་བརྟན་དུ་རུང་བའི་ལག་ཏུ་གསེར་གྱི་ཐུམ་པོ་གཏད་ནས་གླང་པོའི་ཁྱིམ་གྱི་གྲོང་ཁྱེར་དུ་སོང་ངོ་།
en: “ ‘Do as you have said.’ “Thereupon the snake charmer entrusted the box of gold to the hands of a trustworthy man and went to the city of Hastināpura.

source: །དེ་ནས་དེས་མཚོ་དེའི་ཁོ་ར་ཁོར་ཡུག་བརྟགས་ན་མཚན་མ་ལ་མཁས་པ་ཞིག་པས་ཀླུའི་བུ་སྐྱེ་བ་སྣ་ཚོགས་པ་དེ་ནི་ཕྱོགས་འདི་ཁོ་ན་ཉིད་ན་འདུག་གོ་སྙམ་ནས།
en: When he observed the whole area around the pond, because he was familiar with omens, he thought that Janmacitra, the son of a nāga, was in that very place.

source: དེ་ནས་གཏོར་མ་དང་ཡོ་བྱད་ཀྱི་ཕྱིར་སླར་སོང་ནས་བློན་པོ་རྣམས་ལ་སྨྲས་པ།
en: He returned for oblations and necessities, requesting the ministers, ‘Please give me oblations and necessities.

source: བདག་ལ་གཏོར་མ་དང་ཡོ་བྱད་རྣམས་སྩོལ་ཅིག་དང་ཞག་བདུན་གྱི་ཉིན་པར་ཀླུའི་བུ་དེ་ཕྲོགས་ཏེ། ཁྲིད་དེ་མཆིའོ།
en: I will catch and bring the son of a nāga in seven days.’

source: །སྦྲུལ་ཁས་སྡིགས་པ་དེ་ཡང་དེས་མཐོང་ནས་དེ་ནི་བདག་འཕྲོག་ཏུ་འོངས་ཏེ་ཞག་བདུན་གྱི་ཉིན་པར་བདག་ཕྲོགས་ནས་ཕ་མ་དང་བྲལ་བ་ལས་བྱུང་བའི་སྡུག་བསྔལ་ཆེན་པོ་བདག་གིས་མྱོང་བར་འགྱུར་ན་ཇི་ལྟར་བྱ།
en: “Janmacitra too saw the snake charmer and thought, ‘He has come to catch me. I will be caught in seven days and experience the great pain of separation from my parents. What should I do? On whom should I rely?’

source: སུ་ལ་སྐྱབས་བཙལ་སྙམ་པ་དང་། ཡང་མཚོ་དེ་ནས་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ན་རྔོན་པ་སྲན་ཅན་དང་སྤང་ལེབ་ཅན་གཉིས་གནས་ཏེ། དེ་གཉིས་མཚོ་དེའི་དྲུང་ན་གནས་བཅས་ནས་གང་དག་སྐམ་ལ་ཡོད་པའི་སྲོག་ཆགས་རི་བོང་དང་ལྡང་སྐོ་སྐ་དང་། ཕག་ལ་སོགས་པ་མཚོ་དེ་ལ་འཐུང་དུ་འགྲོ་བ་དང་། གང་ཡང་ཆུ་ན་ཡོད་པ་ཉ་དང་རུ་སྦལ་དང་སྦལ་པ་ལ་སོགས་པ་བསད་ཅིང་འཚོ་བར་བྱེད་པ་ལས་དེ་ན་ཡང་སྲན་ཅན་ནི་ཤིའོ།
en: “There had lived near the pond two hunters named Sāraka and Phalaka, They had made their living by the pond by killing terrestrial animals such as rabbits, antelope, and boars that came there to drink water, and aquatic animals such as fish, turtles, and frogs.

source: །སྤང་ལེབ་ཅན་ནི་གསོན་ནོ།
en: By that time, though, Sāraka was dead, and only Phalaka was alive.

source: །ཀླུའི་བུ་སྐྱེ་བ་སྣ་ཚོགས་པས་བསམས་པ་རྔོན་པ་སྤང་ལེབ་ཅན་མ་གཏོགས་པ་སྐྱབས་གཞན་མེད་དོ་སྙམ་ནས། དེ་ནས་མིའི་ཆ་བྱད་དུ་བྱས་ཏེ་རྔོན་པ་སྤང་ལེབ་ཅན་གྱི་དྲུང་དུ་སོང་ནས་སྨྲས་པ། ཀྱེ་ནང་རྗེ་རྒྱལ་པོ་ནོར་ཅན་གྱི་ཡུལ་འབྱོར་པ་དང་རྒྱས་པ་དང་བདེ་བ་དང་ལོ་ལེགས་པ། སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་ཞེས་བྱ་བ་ནས་འབྲས་སཱ་ལུ་དང་། བུ་རམ་ཤིང་དང་བ་ལང་དང་མ་ཧེ་ཕུན་སུམ་ཚོགས་པ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུ་སྟེ། སུའི་མཐུ་ལས་གྱུར་པ་ཇི་ག་ཁྱོད་ཀྱིས་ཤེས་སམ།
en: Janmacitra, the son of a nāga, thought, ‘There is no one but Phalaka on whom I can rely.’ Then, dressed as a human, he went to the hunter Phalaka and said, ‘Sir, do you know by whose power King Dhana’s land is rich, prosperous, peaceful, abundant in food, and full of many people, . . . abundant in rice, sugarcane, cattle, and buffalo?’

source: དེས་སྨྲས་པ་ཤེས་ཏེ་རྒྱལ་པོ་དེ་ཆོས་དང་ལྡན་པས་ཆོས་བཞིན་གྱིས་རྒྱལ་སྲིད་བྱེད་དེ་བྱམས་པའི་སེམས་དང་། ཕན་པའི་སེམས་དང་བརྩེ་བའི་སེམས་ཀྱིས་ཡུལ་བསྐྱངས་པས་སོ། །དེས་སྨྲས་པ།
en: “ ‘I do know,’ answered the hunter. ‘It is because the king is righteous, and he rules over the country in accordance with the Dharma and protects the land with thoughts of love, benefit, and compassion.’ “ ‘Why only that? It must be because of something else,’ he said.

source: ཇི་དེ་འབའ་ཞིག་གམ་གཞན་གྱིས་ཀྱང་ཡིན་རྔོན་པས་སྨྲས་པ། གཞན་གྱི་ཡོན་ཏན་ཞིག་ཀྱང་ཡོད་དེ།
en: “The hunter replied, ‘There is another advantage.

source: མཚོ་འདི་ན་ཀླུའི་བུ་སྐྱེ་བ་སྣ་ཚོགས་པ་ཞེས་བྱ་བ་གནས་ཏེ།
en: There lives in this pond the son of a nāga named Janmacitra.

source: དེས་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་ལེགས་པར་ཕབ་ནས་ལྷག་པར་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཏོ།
en: Because he duly brings rain at the appropriate times, the crops have been more and more abundant.

source: །དེས་ན་ས་གཞི་ལྷག་པར་ལོ་ཏོག་དང་ལྡན་པས་ཡུལ་ཡང་བཟའ་བ་དང་བཏུང་བ་མོད་པར་གྱུར་ཏོ།
en: Therefore, the ground is richer and richer in crops, and so the land has plenty of food and drink.’

source: །སྐྱེ་བ་སྣ་ཚོགས་པས་སྨྲས་པ་གལ་ཏེ་འགའ་ཞིག་གིས་ཀླུའི་བུ་དེ་ཡུལ་འདི་ནས་ཕྲོགས་ན་ཀླུའི་བུ་དེ་ཅིར་འགྱུར།
en: “Janmacitra asked, ‘If someone were to take the son of a nāga by force from this land, what would happen to that son of a nāga?’

source: རུང་བར་མི་འགྱུར་ཏེ།
en: “ ‘It would not be right.

source: དེ་ཕ་མ་དང་བྲལ་བ་ལས་བྱུང་བའི་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་རོ། །རྒྱལ་པོ་དང་ཡུལ་མིས་ཕྲོགས་ན་དེ་ལ་ཁྱོད་ཀྱིས་ཇི་ལྟར་བྱ།
en: He would experience the pain of separation from his parents, and the king and the people would suffer hardships caused by his absence.’ “ ‘What would you do to the abductor?’

source: སྲོག་དང་དབྲལ་བར་བྱའོ།
en: “ ‘I would kill him.’

source: །ཁྱོད་ཀྱིས་ཀླུའི་བུ་དེ་གང་ཡིན་པ་ཤེས་སམ་མི་ཤེས་སོ་དེ་ང་ཉིད་ཡིན་ན་ལྷོ་ཕྱོགས་ལྔ་ལེན་པའི་སྦྲུལ་ཁས་སྡིགས་པ་ང་འཕྲོག་པར་བྱེད་དེ།
en: “ ‘Do you know that son of a nāga?’ “ ‘No, I don’t.’ “ ‘It’s me. A snake charmer from South Pañcāla’s land is trying to catch me.

source: དེ་གཏོར་མ་དང་ཡོ་བྱད་ཀྱི་ཕྱིར་སླར་སོང་ནས་ཞག་བདུན་གྱི་ཉིན་པར་འོང་བར་འགྱུར་ཏེ།
en: He has gone home for oblations and necessities, but he will come back in seven days.

source: འོངས་ནས་མཚོ་ངོགས་སུ་སེང་ལྡེང་གི་ཕུར་པ་གྲྭ་བཞིར་བཙུགས་ལ་ཚོན་སྐུད་སྣ་ཚོགས་ཀྱིས་བྲེས་ཏེ་གསང་སྔགས་རྗོད་པར་བྱེད་ཀྱིས།
en: When he comes back, he will drive wedges made from khadira into the four corners of the banks of the pond, tie strings of various colors, and chant mantras.

source: དེ་ནས་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ཏུ་ཁྱོད་མི་མངོན་པར་འདུག་ལ།
en: You should hide near him.

source: གང་གི་ཚེ་དེས་ཆོ་ག་དེ་ལྟ་བུ་བྱས་པར་གྱུར་པ་དེའི་ཚེ་མཚོའི་ནང་གི་ཆུ་ཁོལ་ཞིང་ལུད་པར་འགྱུར་ཏེ་ང་ཡང་འབྱུང་གིས་དེའི་ཚེ་ཁྱོད་ཀྱིས་སྦྲུལ་ཁས་སྡིགས་དེའི་གནད་དུ་མདས་སྣུན་ལ་དེ་མ་ཐག་ཏུ་དྲུང་དུ་སོང་སྟེ་གསང་སྔགས་སླར་སྡུས་ཤིག །མ་བསྡུས་ན་ཁྱོད་ཀྱི་མགོ་དྲུང་ནས་བཅད་དེ་ས་ལ་བོར་རོ་རེ་ཞེས་སྨྲོས་ཤིག །གལ་ཏེ་དེས་གསང་སྔགས་རྣམས་མ་བསྡུས་པར་སྲོག་དང་བྲལ་ཏེ་ཤིན་ནི་ཁོ་བོ་ཇི་སྲིད་འཚོའི་བར་དུ་གསང་སྔགས་ཀྱི་ཞགས་པས་བཅིངས་པར་འགྱུར་རོ།
en: When he has finished this preparation, the water in the pond will boil and overflow, and I will appear. At that time, you should shoot the snake charmer in a vital part, approach him quickly, and say, “Withdraw the mantra. If you do not, I will cut off your head and throw it on the ground.” If he loses his life and dies without withdrawing the mantra, I will be bound by the noose of the mantra throughout the rest of my life.’

source: །རྔོན་པས་སྨྲས་པ། གལ་ཏེ་ཁྱོད་གཅིག་པུ་ལ་ཕན་ཐོགས་ན་ཡང་དེ་བཞིན་དུ་ཁོ་བོ་ཁོ་ནས་བྱ་ན་ཡུལ་མཐའ་དག་ལ་ཕན་ན་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ།
en: “ ‘Even only to benefit you, I will do that,’ said the hunter, ‘not to mention benefiting the entire country.

source: ཁོ་བོས་སྐྱབས་བྱས་སོང་ཤིག །དེ་ནས་ཀླུའི་བུ་དེས་དེ་ལ་དབེན་པའི་ཕྱོགས་ཤིག་བསྟན་ནས།
en: I will help you.’ “Then the son of a nāga indicated a certain hiding place.

source: ཇི་ཙམ་ན་རྔོན་པ་དེ་ཞག་བདུན་གྱི་ཉིན་པར་ཕྱོགས་དབེན་པར་བདག་ཉིད་གབ་སྟེ་འདུག་པ་དང་། སྦྲུལ་ཁས་སྡིགས་པ་དེ་ཡང་འོངས་ནས་གཏོར་མ་དང་ཡོ་བྱད་ཀྱི་ཆོ་ག་བྱ་བར་རྩོམ་སྟེ།
en: On the seventh day, the hunter was hiding in that hiding place, and the snake charmer came there too and began to prepare the oblations and necessities.

source: དེ་ཕྱོགས་བཞིར་སེང་ལྡེང་གི་ཕུར་བུ་བཞི་བཙུགས།
en: He drove wedges made from khadira into the four corners of the banks of the pond.

source: ཚོན་སྐུད་སྣ་ཚོགས་ཀྱིས་བྲེས་ཏེ་གསང་སྔགས་བརྗོད་དོ།
en: He tied strings of various colors and chanted mantras.

source: །དེ་ནས་ཆུ་དེ་ཁོལ་དུ་ཆ་བ་དང་རྔོན་པས་གནད་དུ་མདས་བསྣུན་ནས་རལ་གྲི་ཤུབས་ནས་ཕྱུང་སྟེ་སྨྲས་པ། ཁྱོད་ཀྱིས་ངེད་ཀྱི་ཡུལ་ན་གནས་པའི་ཀླུའི་བུ་གསང་སྔགས་ཀྱིས་དབྲོག་གམ།
en: Then the water began to boil. The hunter shot him in a vital part and, having unsheathed a sword, said, ‘Are you trying to take the son of a nāga living in our land by force with a mantra? Withdraw the mantra.
